# CONTENT LIST
1. Importing libraries
2. Importing customers data
3. Exploring the customers data
4. Renaming the column names
5. Changing the data types
6. Data consistency check
7. Combining and exporting the datasets

# 01 Importing libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

# 02 Importing customers data

In [2]:
# Creating common folder path
path = r'C:\Users\Mukund\Desktop\Career Foundry\Instacart_Grocery_Basket_Analysis_May_2021'

In [3]:
path

'C:\\Users\\Mukund\\Desktop\\Career Foundry\\Instacart_Grocery_Basket_Analysis_May_2021'

In [4]:
# Importing customers data using OS library
df_customers = pd.read_csv(os.path.join(path, 'Data', 'Original_data', 'customers.csv'), index_col = False)

# 03 Exploring the customers data

In [5]:
# checking the rows and columns
df_customers

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [6]:
# Checking some basic information of dataset
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
# Checking descriptive statistics
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

# 04 Renaming the column names

In [8]:
df_customers.rename(columns = {'First Name' : 'First_Name','Surnam' : 'Surname','n_dependants':'No_of_dependants','fam_status':'Family_status','income':'Annual_income'}, inplace = True)

# 05 Changing the data types

In [9]:
df_customers['First_Name'] = df_customers['First_Name'].astype('str')

In [10]:
df_customers['Surname'] = df_customers['Surname'].astype('category')

In [11]:
df_customers['Gender'] = df_customers['Gender'].astype('category')

In [12]:
df_customers['STATE'] = df_customers['STATE'].astype('category')

In [13]:
df_customers['Family_status'] = df_customers['Family_status'].astype('category')

In [14]:
df_customers['No_of_dependants'] = df_customers['No_of_dependants'].astype('int8')

In [15]:
df_customers['Age'] = df_customers['Age'].astype('int8')

In [16]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int64
 1   First_Name        206209 non-null  object
 2   Surname           206209 non-null  category
 3   Gender            206209 non-null  category
 4   STATE             206209 non-null  category
 5   Age               206209 non-null  int8
 6   date_joined       206209 non-null  object
 7   No_of_dependants  206209 non-null  int8
 8   Family_status     206209 non-null  category
 9   Annual_income     206209 non-null  int64
dtypes: category(4), int64(2), int8(2), object(2)
memory usage: 7.7+ MB

# 06 Data consistency check

In [17]:
# Checking for mixed-type data
for col in df_customers.columns.tolist():
  mixed_type = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[mixed_type]) > 0:
    print (col)

No Mixed-type data found

In [18]:
# Checking for missing values in customers data
df_customers.isnull().sum()

user_id             0
First_Name          0
Surname             0
Gender              0
STATE               0
Age                 0
date_joined         0
No_of_dependants    0
Family_status       0
Annual_income       0
dtype: int64

There are no missing values in dataset

In [19]:
# Checking for duplicates in customers data
df_customers_dups = df_customers[df_customers.duplicated()]

In [20]:
df_customers_dups

Empty DataFrame
Columns: [user_id, First_Name, Surname, Gender, STATE, Age, date_joined, No_of_dependants, Family_status, Annual_income]
Index: []

No duplicates found

In [21]:
df_customers['user_id'].max()

206209

In [22]:
df_customers['user_id'].unique()

array([ 26711,  33890,  65803, ..., 135902,  81095,  80148], dtype=int64)

# 07 Combining and exporting the datasets

In [23]:
# First we will import the orders and products merged data set
df_ords_prods_merged  = pd.read_pickle(os.path.join(path, 'Data', 'Prepared_data', 'Orders_Poducts_Mrged_task_4_8_Final.pkl'))

In [24]:
# Removing '_merge' column
df_ords_prods_merged_1 = df_ords_prods_merged.drop(columns = ['_merge'])

In [25]:
df_ords_prods_merged_1.shape

(32404859, 23)

In [26]:
df_ords_prods_merged_1['user_id'].unique()

array([ 38259, 196224, 138499, ...,  27382,  56454,  74506], dtype=int64)

In [27]:
df_ords_prods_merged_1['Busiest_Day'] = df_ords_prods_merged_1['Busiest_Day'].astype('category')

In [28]:
df_ords_prods_merged_1['Busiest_Days'] = df_ords_prods_merged_1['Busiest_Days'].astype('category')

In [29]:
df_ords_prods_merged_1['price_range_loc'] = df_ords_prods_merged_1['price_range_loc'].astype('category')

In [30]:
df_ords_prods_merged_1['max_order'] = df_ords_prods_merged_1['max_order'].astype('int8')

In [31]:
df_ords_prods_merged_1['aisle_id'] = df_ords_prods_merged_1['aisle_id'].astype('int16')

In [32]:
df_ords_prods_merged_1['add_to_cart_order'] = df_ords_prods_merged_1['add_to_cart_order'].astype('int8')

In [33]:
df_ords_prods_merged_1['order_number'] = df_ords_prods_merged_1['order_number'].astype('int8')

In [34]:
df_ords_prods_merged_1['Frequency'] = df_ords_prods_merged_1['Frequency'].astype('uint16')

In [35]:
df_ords_prods_merged_1['Spending'] = df_ords_prods_merged_1['Spending'].astype('float16')

In [36]:
df_ords_prods_merged_1['prices'] = df_ords_prods_merged_1['Spending'].astype('int32')

In [37]:
df_ords_prods_merged_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int16
 3   department_id           int64
 4   prices                  int32
 5   order_id                int64
 6   add_to_cart_order       int8
 7   reordered               int8
 8   user_id                 int64
 9   order_number            int8
 10  orders_day_of_week      int8
 11  order_hour_of_day       int8
 12  days_since_prior_order  int16
 13  price_range_loc         category
 14  Busiest_Day             category
 15  Busiest_Days            category
 16  busiest_period_of_day   object
 17  max_order               int8
 18  loyalty_flag            object
 19  Spending                float16
 20  Spending_Flag           object
 21  Frequency               uint16
 22  Order_Frequency_Flag    object
dtypes: category(3), float16(1), int16(2), int32(1), int64(4), int8(6), object(5), uint16(1)
memory usage: 3.0+ GB

In [38]:
df_ords_prods_merged_1.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,add_to_cart_order,reordered,user_id,order_number,...,price_range_loc,Busiest_Day,Busiest_Days,busiest_period_of_day,max_order,loyalty_flag,Spending,Spending_Flag,Frequency,Order_Frequency_Flag
0,1,Chocolate Sandwich Cookies,61,19,7,1107,7,0,38259,2,...,Mid-range product,Regularly busy,Busiest days,Most orders,4,New customer,7.164062,Low spender,7,Non-frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5,5319,3,1,196224,65,...,Mid-range product,Regularly busy,Busiest days,Most orders,99,Loyal customer,5.343750,Low spender,1,Non-frequent customer
2,1,Chocolate Sandwich Cookies,61,19,7,7540,4,1,138499,8,...,Mid-range product,Busiest day,Busiest days,Most orders,23,Regular customer,7.468750,Low spender,7,Non-frequent customer
3,1,Chocolate Sandwich Cookies,61,19,6,9228,2,0,79603,2,...,Mid-range product,Regularly busy,Regular days,Most orders,5,New customer,6.984375,Low spender,28,Non-frequent customer
4,1,Chocolate Sandwich Cookies,61,19,7,9273,30,0,50005,1,...,Mid-range product,Regularly busy,Busiest days,Most orders,22,Regular customer,7.492188,Low spender,7,Non-frequent customer

In [39]:
# We have user_id column as a common variable in both data sets. So, we will merge both of them using user_id
df_final_data = df_ords_prods_merged_1.merge(df_customers, on = 'user_id', indicator = True)

In [40]:
# Checking the first rows of final merged data
df_final_data.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,add_to_cart_order,reordered,user_id,order_number,...,First_Name,Surname,Gender,STATE,Age,date_joined,No_of_dependants,Family_status,Annual_income,_merge
0,1,Chocolate Sandwich Cookies,61,19,7,1107,7,0,38259,2,...,nan,Bean,Female,District of Columbia,68,6/30/2019,2,married,142744,both
1,769,Sliced American Cheese,21,16,7,1107,10,0,38259,2,...,nan,Bean,Female,District of Columbia,68,6/30/2019,2,married,142744,both
2,5258,Sparkling Water,115,7,7,3369664,9,0,38259,3,...,nan,Bean,Female,District of Columbia,68,6/30/2019,2,married,142744,both
3,6184,Clementines,32,4,7,1107,14,1,38259,2,...,nan,Bean,Female,District of Columbia,68,6/30/2019,2,married,142744,both
4,6184,Clementines,32,4,7,2899757,6,0,38259,1,...,nan,Bean,Female,District of Columbia,68,6/30/2019,2,married,142744,both

In [41]:
df_final_data.shape

(32404859, 33)

In [42]:
df_final_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 33 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int16
 3   department_id           int64
 4   prices                  int32
 5   order_id                int64
 6   add_to_cart_order       int8
 7   reordered               int8
 8   user_id                 int64
 9   order_number            int8
 10  orders_day_of_week      int8
 11  order_hour_of_day       int8
 12  days_since_prior_order  int16
 13  price_range_loc         category
 14  Busiest_Day             category
 15  Busiest_Days            category
 16  busiest_period_of_day   object
 17  max_order               int8
 18  loyalty_flag            object
 19  Spending                float16
 20  Spending_Flag           object
 21  Frequency               uint16
 22  Order_Frequency_Flag    object
 23  First_Name              object
 24  Surname                 category
 25  Gender                  category
 26  STATE                   category
 27  Age                     int8
 28  date_joined             object
 29  No_of_dependants        int8
 30  Family_status           category
 31  Annual_income           int64
 32  _merge                  category
dtypes: category(8), float16(1), int16(2), int32(1), int64(5), int8(8), object(7), uint16(1)
memory usage: 4.0+ GB

In [43]:
df_final_data['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [44]:
df_final_data.describe()

,product_id,aisle_id,department_id,prices,order_id,add_to_cart_order,reordered,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,max_order,Spending,Frequency,Age,No_of_dependants,Annual_income
count,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07
mean,2.559866e+04,7.119612e+01,9.919792e+00,1.148251e+01,1.710745e+06,8.352325e+00,5.895873e-01,1.029372e+05,1.714230e+01,2.738867e+00,1.342515e+01,1.039267e+01,3.305217e+01,NaN,9.606230e+00,4.946527e+01,1.501896e+00,9.943773e+04
std,1.408400e+04,3.821139e+01,6.281485e+00,8.325486e+01,9.872988e+05,7.127111e+00,4.919087e-01,5.946610e+04,1.753532e+01,2.090077e+00,4.246380e+00,8.917825e+00,2.515525e+01,NaN,6.452981e+00,1.848558e+01,1.118865e+00,4.305727e+04
min,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,2.000000e+00,-1.280000e+02,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,1.800000e+01,0.000000e+00,2.590300e+04
25%,1.354400e+04,3.100000e+01,4.000000e+00,7.000000e+00,8.559470e+05,3.000000e+00,0.000000e+00,5.142200e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00,1.300000e+01,7.386719e+00,6.000000e+00,3.300000e+01,1.000000e+00,6.700400e+04
50%,2.530200e+04,8.300000e+01,9.000000e+00,7.000000e+00,1.711049e+06,6.000000e+00,1.000000e+00,1.026160e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00,2.600000e+01,7.824219e+00,7.000000e+00,4.900000e+01,2.000000e+00,9.661800e+04
75%,3.794700e+04,1.070000e+02,1.600000e+01,8.000000e+00,2.565499e+06,1.100000e+01,1.000000e+00,1.543890e+05,2.400000e+01,5.000000e+00,1.600000e+01,1.400000e+01,4.700000e+01,8.257812e+00,1.200000e+01,6.500000e+01,3.000000e+00,1.279120e+05
max,4.968800e+04,1.340000e+02,2.100000e+01,2.500800e+04,3.421083e+06,1.270000e+02,1.000000e+00,2.062090e+05,9.900000e+01,6.000000e+00,2.300000e+01,3.000000e+01,9.900000e+01,2.500800e+04,3.000000e+01,8.100000e+01,3.000000e+00,5.939010e+05

In [46]:
# Exporting merged final data
df_final_data.to_pickle(os.path.join(path, 'Data','Prepared_data', 'Final_data_Task9_Part1.pkl'))